Tekla.Structures.DirectManipulation.Adapter.EventRegistry.PickEvents
The Tekla.Structures.DirectManipulation.Adapter.EventRegistry.PickEvents class contains the identifiers for pick events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.PickEvents.ObjectPicked
Expected identification string for pick events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.PickEvents.ObjectPickUndone
Expected identification string for pick undone events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.PickEvents.PickerStarted
Expected identification string for picker start events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.PickEvents.PickerEnded
Expected identification string for picker ended events.

Tekla.Structures.DirectManipulation.Adapter.EventRegistry.PickEvents.PickPointTolerationRequested
Expected identification string for pick toleration request events.